tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "junelife/tap", "git@github.com:junelife/homebrew-tap.git"
tap "koekeishiya/formulae"
tap "cmacrae/formulae"

# CLI
brew "ack"
brew "bat"
brew "cmake"
brew "exa"
brew "go"
brew "grc"
brew "hstr"
brew "htop"
brew "neovim"
brew "jq"
brew "ripgrep"
brew "starship"
brew "ssh-copy-id", link: true
brew "wget"
brew "yadm"

# System
brew "koekeishiya/formulae/yabai"
brew "koekeishiya/formulae/skhd"
brew "cmacrae/formulae/spacebar"

# Apps
cask "alacritty"
cask "font-hack-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "google-chrome", greedy: true
cask "firefox", greedy: true
cask "font-fontawesome"
cask "vivaldi", greedy: true

# Dev
brew "dfu-util"
brew "docker"
brew "docker-machine"
brew "openssl@1.1"
brew "gtk4"
brew "make"
brew "ninja"
brew "openssl@3"
brew "postgresql@14"
brew "protobuf"
brew "stlink"
cask "stm32cubeprogrammer"
